In [1]:
import pandas as pd

In [2]:
from math import floor

In [3]:
df = pd.read_csv('input', header=None)

In [4]:
df.columns = ["mass"]

In [5]:
df

      mass
0    83285
1    96868
2   121640
3    51455
4   128067
..     ...
95   97162
96   80664
97  149742
98   88983
99   74518

[100 rows x 1 columns]

In [6]:
df["fuel"] = df.apply(lambda row: floor(row.mass / 3) - 2, axis = 1)

In [7]:
df

      mass   fuel
0    83285  27759
1    96868  32287
2   121640  40544
3    51455  17149
4   128067  42687
..     ...    ...
95   97162  32385
96   80664  26886
97  149742  49912
98   88983  29659
99   74518  24837

[100 rows x 2 columns]

In [8]:
floor(12 / 3) - 2

2

In [9]:
floor(14 / 3) - 2

2

In [10]:
floor(1969 / 3) - 2

654

In [11]:
floor(100756 / 3) - 2

33583

In [12]:
df["fuel"].sum()

3289802

In [13]:
def total_fuel(mass):
    fuel = floor(mass / 3) - 2
    if fuel <= 0:
        return 0
    else:
        fuel = fuel + total_fuel(fuel)
        return fuel

In [14]:
total_fuel(12)

2

In [15]:
total_fuel(1969)

966

In [16]:
total_fuel(100756)

50346

In [17]:
df["total_fuel"] = df.apply(lambda row: total_fuel(row.mass), axis = 1)

In [18]:
df

      mass   fuel  total_fuel
0    83285  27759       41611
1    96868  32287       48400
2   121640  40544       60786
3    51455  17149       25696
4   128067  42687       64002
..     ...    ...         ...
95   97162  32385       48548
96   80664  26886       40300
97  149742  49912       74838
98   88983  29659       44460
99   74518  24837       37229

[100 rows x 3 columns]

In [19]:
df["total_fuel"].sum()

4931831